### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/ec2`

✅ **Plan Status:** Success
✅ **Format Check:** Passed

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mAcquiring state lock. This may take a few moments...
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_subnet.this[0]: Reading...
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Reading...
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_ssm_parameter.this: Reading...
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Read complete after 0s [id=aws]
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role_policy[0]: Reading...
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
[0;90m22:58:43.350[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_ssm_parameter.this: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/al2023-ami-kernel-default-x86_64]
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_subnet.this[0]: Read complete after 1s [id=subnet-0ec3e8c57a1cf0762]
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_instance_profile.this[0] will be created
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_instance_profile" "this" {
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn         = (known after apply)
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date = (known after apply)
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = (known after apply)
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = "node-hands-on-datadog-eu-south-2-"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path        = "/"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = (known after apply)
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags        = {
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.351[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all    = {
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id   = (known after apply)
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role.this[0] will be created
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role" "this" {
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                   = (known after apply)
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assume_role_policy    = jsonencode(
[0;90m22:58:43.352[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action    = "sts:AssumeRole"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect    = "Allow"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Principal = {
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Service = "ec2.amazonaws.com"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid       = "EC2AssumeRole"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date           = (known after apply)
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description           = "IAM role for telemetry and SSM access to the lab"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_detach_policies = true
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                    = (known after apply)
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + managed_policy_arns   = (known after apply)
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_session_duration  = 3600
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                  = (known after apply)
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix           = "node-hands-on-datadog-eu-south-2-"
[0;90m22:58:43.353[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path                  = "/"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                  = {
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all              = {
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id             = (known after apply)
[0;90m22:58:43.354[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inline_policy (known after apply)
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id         = (known after apply)
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role       = (known after apply)
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy_attachment.this["SSMReadOnlyAccess"] will be created
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id         = (known after apply)
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role       = (known after apply)
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_instance.this[0] will be created
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_instance" "this" {
[0;90m22:58:43.355[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ami                                  = "ami-0ea1dc7d933cc2e03"
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                  = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + associate_public_ip_address          = false
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone                    = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + disable_api_stop                     = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + disable_api_termination              = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ebs_optimized                        = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_primary_ipv6                  = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_destroy                        = false
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + get_password_data                    = false
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + host_id                              = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + host_resource_group_arn              = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + iam_instance_profile                 = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                   = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_initiated_shutdown_behavior = (known after apply)
[0;90m22:58:43.356[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_lifecycle                   = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_state                       = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_type                        = "t3.micro"
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_address_count                   = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_addresses                       = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_name                             = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + monitoring                           = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + outpost_arn                          = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + password_data                        = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + placement_group                      = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + placement_group_id                   = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + placement_partition_number           = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + primary_network_interface_id         = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns                          = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_ip                           = (known after apply)
[0;90m22:58:43.357[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_dns                           = (known after apply)
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + public_ip                            = (known after apply)
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                               = "eu-south-2"
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + secondary_private_ips                = (known after apply)
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_groups                      = (known after apply)
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_dest_check                    = true
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + spot_instance_request_id             = (known after apply)
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_id                            = "subnet-0ec3e8c57a1cf0762"
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                 = {
[0;90m22:58:43.358[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                             = {
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.359[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tenancy                              = (known after apply)
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + user_data                            = <<-EOT
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            #!/bin/bash
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            exec > >(tee /var/log/user-data.log|logger -t user-data -s 2>/dev/console) 2>&1
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            echo "Starting Datadog agent provisioning..."
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # 1. Retrieve API Key from SSM Parameter Store
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # jq is required to parse the JSON response
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            yum install -y jq
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            DD_API_KEY=$(aws ssm get-parameter \
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              --name "/labs/datadog/DD_API_KEY" \
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              --with-decryption \
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              --region eu-south-2 \
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              --output json | jq -r '.Parameter.Value')
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            if [ -z "$DD_API_KEY" ] || [ "$DD_API_KEY" == "null" ]; then
[0;90m22:58:43.360[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              echo "CRITICAL: Could not retrieve API Key from SSM Parameter Store. Aborting."
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              exit 1
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            fi
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # 2. Install Datadog agent in a unattended manner
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            DD_API_KEY=$DD_API_KEY \
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            DD_SITE="datadoghq.eu" \
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            DD_HOST_TAGS="env:labs,role:datadog-agent-test" \
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            bash -c "$(curl -L https://s3.amazonaws.com/dd-agent/scripts/install_script_agent7.sh)"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            echo "Datadog agent installed successfully."
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        EOT
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + user_data_base64                     = (known after apply)
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + user_data_replace_on_change          = false
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + volume_tags                          = {
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.361[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_security_group_ids               = (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + capacity_reservation_specification (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cpu_options (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + credit_specification {}
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ebs_block_device (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enclave_options {
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + enabled = (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ephemeral_block_device (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_market_options (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + maintenance_options (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + metadata_options {
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + http_endpoint               = "enabled"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + http_protocol_ipv6          = "disabled"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + http_put_response_hop_limit = 1
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + http_tokens                 = "required"
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + instance_metadata_tags      = (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface (known after apply)
[0;90m22:58:43.362[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + primary_network_interface (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + private_dns_name_options (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + root_block_device (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + secondary_network_interface (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.this[0] will be created
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group" "this" {
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Managed by Terraform"
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = "node-hands-on-datadog-eu-south-2-"
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.363[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = "vpc-086dab9db92fd727e"
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.364[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_vpc_security_group_egress_rule.this["ipv4_default"] will be created
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_vpc_security_group_egress_rule" "this" {
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_ipv4              = "0.0.0.0/0"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Allow all IPv4 traffic"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ip_protocol            = "-1"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_id      = (known after apply)
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_rule_id = (known after apply)
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2-ipv4_default"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.365[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2-ipv4_default"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_vpc_security_group_egress_rule.this["ipv6_default"] will be created
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_vpc_security_group_egress_rule" "this" {
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cidr_ipv6              = "::/0"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Allow all IPv6 traffic"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ip_protocol            = "-1"
[0;90m22:58:43.366[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                 = "eu-south-2"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_id      = (known after apply)
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_rule_id = (known after apply)
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2-ipv6_default"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Name"        = "node-hands-on-datadog-eu-south-2-ipv6_default"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m22:58:43.367[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "datadog-agent-test"
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 8 to add, 0 to change, 0 to destroy.
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ami                                = "ami-0ea1dc7d933cc2e03"
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + arn                                = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + availability_zone                  = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + capacity_reservation_specification = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ebs_block_device                   = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ebs_volumes                        = {}
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ephemeral_block_device             = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_instance_profile_arn           = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_instance_profile_id            = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_instance_profile_unique        = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_role_arn                       = (known after apply)
[0;90m22:58:43.368[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_role_name                      = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + iam_role_unique_id                 = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + id                                 = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + instance_state                     = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ipv6_addresses                     = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + outpost_arn                        = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + password_data                      = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + primary_network_interface_id       = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + private_dns                        = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + private_ip                         = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + public_dns                         = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + public_ip                          = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + root_block_device                  = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + security_group_arn                 = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + security_group_id                  = (known after apply)
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + tags_all                           = {
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + Name        = "node-hands-on-datadog-eu-south-2"
[0;90m22:58:43.369[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + created-by  = "github-actions"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + creator     = "terragrunt"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + environment = "labs"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + is-lab      = "true"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + lab-name    = "hands-on-datadog"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner       = "dfbx"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + repository  = "https://github.com/darthfabax-org/iac"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "datadog-agent-test"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + state       = "true"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ttl         = "7d"
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[0;90m22:58:43.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22646623473)*